Revit 2024 API
Document.NewArea Method
Creates a new area
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Area NewArea(
	ViewPlan areaView,
	UV point
)
Visual Basic
Public Function NewArea ( _
	areaView As ViewPlan, _
	point As UV _
) As Area
Visual C++
public:
Area^ NewArea(
	ViewPlan^ areaView,
	UV^ point
)
Parameters
areaView
Type: Autodesk.Revit.DB.ViewPlan
The view of area element.
point
Type: Autodesk.Revit.DB.UV
The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the area view does not exist in the given document.
See Also
Document Class
Autodesk.Revit.Creation Namespace